ХамелионЦРПТ/src/Documents/Регламенты_ХамелеонЦРПТ/Регламенты_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Регламенты_ХамелеонЦРПТ</name>
  <attributes>
    <name>ВыполнятьРегламент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипЗапросаОбработки</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/Documents/Регламенты_ХамелеонЦРПТ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	ВремяВыполнения="";
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	Если Элементы.ТипЗапросаОбработки.ТекущиеДанные<>Неопределено Тогда
		ПолучитьПараметрыРегламентногоЗадания=ПараметрыРеглЗаданияТекущейСтроки(Элементы.ТипЗапросаОбработки.ТекущиеДанные.Тип);
		Если ПолучитьПараметрыРегламентногоЗадания.НаКлиенте Тогда
			Попытка
				ВыполнитьРегламентНаКлиенте_ХамелеонЦРПТ(ПолучитьПараметрыРегламентногоЗадания.Алгоритм);
			Исключение
				ПоказатьПредупреждение(,"Не удалось выполнить сценарий. Ошибка "+ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Попытка
				ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ВыполнитьНаСервере(ПолучитьПараметрыРегламентногоЗадания.Тип);
			Исключение
				ПоказатьПредупреждение(,"Не удалось выполнить сценарий. Ошибка "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРеглЗаданияТекущейСтроки(Тип)
	Возврат Новый Структура("Тип,НаКлиенте,Алгоритм",Тип.Ссылка,Тип.ВыполнитьНаКлиенте,Тип.Алгоритм);
КонецФункции

&НаКлиенте
Процедура ХХХава(Команда)
	// Вставить содержимое обработчика.
	Если Элементы.ТипЗапросаОбработки.ТекущиеДанные<>Неопределено Тогда
		РРР=0;
		
		Форм=ОткрытьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.ВводЧисла",,,,,,Новый ОписаниеОповещения("Продукт",ЭтаФорма,Элементы.ТипЗапросаОбработки.ТекущиеДанные));
	Форм.Число=РРР;
	Форм.Заголовок="Ввести число";
		
		//ПоказатьВводЧисла(Новый ОписаниеОповещения("Продукт",ЭтаФорма,Элементы.ТипЗапросаОбработки.ТекущиеДанные),РРР);
			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Продукт(АА,РР) Экспорт
	Если ЗначениеЗаполненО(АА) тогда
		Строк=Элементы.ТипЗапросаОбработки.ТекущиеДанные;
		Датаначала=Строк.Время+АА*60;
		Пока ДатаНачала<=Дата(1,1,2,0,0,0) Цикл
			ДДД=Объект.ТипЗапросаОбработки.Добавить();
			ЗаполнитьЗначенияСвойств(ДДД,РР);
			ДДД.Время=Датаначала;
			Датаначала=Датаначала+АА*60;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗапросаОбработкиВремяПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Элементы.ТипЗапросаОбработки.ТекущиеДанные.Время>=Дата(1,1,1,23,54,0) Тогда
		
		Сообщить("Не используйте последние 5 минут суток");
		
	КонецЕсли;
КонецПроцедуры
